{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.8.4", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null], "dtype": "string", "sparse": false, "ragged": false, "name": "keras_layer_1_input"}}, {"class_name": "KerasLayer", "config": {"name": "keras_layer_1", "trainable": true, "batch_input_shape": [null], "dtype": "string", "handle": "https://tfhub.dev/google/nnlm-en-dim50/2"}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": {"class_name": "BinaryCrossentropy", "config": {"reduction": "auto", "name": "binary_crossentropy", "from_logits": true, "label_smoothing": 0}}, "metrics": [[{"class_name": "BinaryAccuracy", "config": {"name": "accuracy", "dtype": "float32", "threshold": 0.0}}]], "loss_weights": null, "sample_weight_mode": null, "weighted_metrics": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of46.bin", "group1-shard2of46.bin", "group1-shard3of46.bin", "group1-shard4of46.bin", "group1-shard5of46.bin", "group1-shard6of46.bin", "group1-shard7of46.bin", "group1-shard8of46.bin", "group1-shard9of46.bin", "group1-shard10of46.bin", "group1-shard11of46.bin", "group1-shard12of46.bin", "group1-shard13of46.bin", "group1-shard14of46.bin", "group1-shard15of46.bin", "group1-shard16of46.bin", "group1-shard17of46.bin", "group1-shard18of46.bin", "group1-shard19of46.bin", "group1-shard20of46.bin", "group1-shard21of46.bin", "group1-shard22of46.bin", "group1-shard23of46.bin", "group1-shard24of46.bin", "group1-shard25of46.bin", "group1-shard26of46.bin", "group1-shard27of46.bin", "group1-shard28of46.bin", "group1-shard29of46.bin", "group1-shard30of46.bin", "group1-shard31of46.bin", "group1-shard32of46.bin", "group1-shard33of46.bin", "group1-shard34of46.bin", "group1-shard35of46.bin", "group1-shard36of46.bin", "group1-shard37of46.bin", "group1-shard38of46.bin", "group1-shard39of46.bin", "group1-shard40of46.bin", "group1-shard41of46.bin", "group1-shard42of46.bin", "group1-shard43of46.bin", "group1-shard44of46.bin", "group1-shard45of46.bin", "group1-shard46of46.bin"], "weights": [{"name": "dense_2/kernel", "shape": [50, 16], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [1], "dtype": "float32"}, {"name": "Variable", "shape": [963812, 50], "dtype": "float32"}]}]}